Repository: 84000/data-translation-memory
Catalog: toh271-v2.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: praised what the Bhagavān had said.

source: འཕགས་པ་སངས་རྒྱས་བརྒྱད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Mahāyāna sūtra “The Eight Buddhas.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: It was translated and finalized by the Indian abbots Jinamitra and Surendrabodhi and by the great editor-translator Venerable Yeshé Dé.

source: ཤློ་ཀ་དགུ་བཅུ་རྩ་གཅིག། །།
en: The text contains ninety-one stanzas.
